## :x: Plan result
[Build details](https://github.com/yuya-takeyama/terraform-modules/actions/runs/1085045756)
<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * github_repository.readonly-poly-repo[&#34;bar&#34;]
  * github_repository.readonly-poly-repo[&#34;foo&#34;]
<details>
<summary>Command output</summary>


```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository.readonly-poly-repo["bar"] will be created
  + resource "github_repository" "readonly-poly-repo" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "This repository is read only"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + homepage_url           = "https://github.com/yuya-takeyama/terraform-modules"
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "terraform-module-bar"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
    }

  # github_repository.readonly-poly-repo["foo"] will be created
  + resource "github_repository" "readonly-poly-repo" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "This repository is read only"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + homepage_url           = "https://github.com/yuya-takeyama/terraform-modules"
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "terraform-module-foo"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
╷
│ Error: Error releasing the state lock
│ 
│ Error message: googleapi: Error 403:
│ github-actions@jp-yuyat-terraform-modules.iam.gserviceaccount.com does not
│ have storage.objects.delete access to the Google Cloud Storage object.,
│ forbidden
│ Lock Info:
│   ID:        1627733253985059
│   Path:      gs://jp-yuyat-terraform-modules-github-repositories-tfstate/default.tflock
│   Operation: OperationTypePlan
│   Who:       runner@fv-az144-511
│   Version:   1.0.3
│   Created:   2021-07-31 12:07:33.901952961 +0000 UTC
│   Info:      
│ 
│ 
│ Terraform acquires a lock when accessing your state to prevent others
│ running Terraform to potentially modify the state at the same time. An
│ error occurred while releasing this lock. This could mean that the lock
│ did or did not release properly. If the lock didn't release properly,
│ Terraform may not be able to run future commands since it'll appear as if
│ the lock is held.
│ 
│ In this scenario, please call the "force-unlock" command to unlock the
│ state manually. This is a very dangerous operation since if it is done
│ erroneously it could result in two people modifying state at the same time.
│ Only call this command if you're certain that the unlock above failed and
│ that no one else is holding a lock.
╵

```

</details>


<!-- github-comment: {"Command":"plan","JobName":"terraform-plan","PRNumber":1,"Program":"tfcmt","SHA1":"af57ebe4ef3dc0cff1b2cefe27369adc28a4111e","Vars":{},"WorkflowName":"test"} -->